/***************************************************
 * Date:2024/11/21
1）操作符
    & 按位与
    | 按位或
    ^ 按位异或
        A 异或 A = 0
        0 异或 A = A
        满足交换律 ：3^3^5 = 0^5 = 5
                    3^5^3 = 3^3^5 = 0^5 = 5
2）强制转换
3）sizeof 是操作符，不是函数，sizeof a sizeof （a）sizeof （int） 可以 size of int 不可以
   strlen 是函数，不是操作符，用来求字符串长度
4）逻辑与 或 会短路   多个与在一起  遇见一个假就停止计算
5）逗号表达式 从左向右算 最后一个表达式结果为整个表达式结果
6）下标引用操作符 arr[7]和7[arr]等价  arr[7]等价*(arr + 7)  *(7 + arr)
***************************************************/
#include <stdio.h>

int main () {
    // int a = 3; // 4 字节 8 比特
    // int b = -5;
    // int c = a & b;
    // int d = a | b;
    // int e = a ^ b;
    // a = a ^ b;
    // b = a ^ b;
    // a = a ^ b;
    // // 00000000 00000000 00000000 00000011 -   3的补码
    // // 10000000 00000000 00000000 00000101 -  -5的源码
    // // 01111111 11111111 11111111 11111010 -  -5的反码
    // // 01111111 11111111 11111111 11111011 -  -5的补码
    // // 00000000 00000000 00000000 00000011 -    按位与
    // // %d ： 打印一个有符号整数（源码）
    // printf("%d %d %d %d %d\n", c, d, e, a, b);

    int num = 3.14;
    int num1 = (int)3.14;
    printf("%d\n", num);

    int i = 0, l = 0, k = 2, h = 3, g = 4;
    i = l++ && ++k && g++;
    printf("%d %d %d %d\n", l, k, h, g);

    int a = 1;
    int b = 2;
    int c = (a > b, a = b + 10, a, b = a + 1);
    printf("%d\n", c);
    return 0;
}